package exercise;

import java.util.Arrays;
import java.util.Scanner;

/**
 * ·£´ý ÀÌ¸§ Ãâ·Â±â
 * @author HJ
 *
 */
public class RandomNaimg {

	public String[] naming() {
		System.out.println("[·£´ý ÀÌ¸§ ¸¸µé±â ÇÁ·Î±×·¥]");
		Scanner sc = new Scanner(System.in);
		int col = 5;

		// normal
		String[] first = { "¸¶", "³ª", "¹æ", "¿À", "Áö", "µÎ", "±è", "ÀÌ", "¹Ú", "ÃÖ", "Á¤", "°­", "Á¶", "À±", "Àå", "ÀÓ", "ÇÑ",
				"¿À", "¼­", "½Å", "±Ç", "È²", "¾È", "¼Û", "Àü", "È«", "À¯", "°í", "¹®", "¾ç", "¼Õ", "¹è", "Á¶", "¹é", "Çã", "³²",
				"½É", "³ë", "Á¤", "ÇÏ", "°û", "¼º", "Â÷", "ÁÖ", "¿ì", "±¸", "½Å", "ÀÓ", "Àü", "¹Î"};

		// È®·üÃß°¡ - ÇÑ±¹ÀÎ ÃÖ´Ù¼º¾¾(±è>ÀÌ>¹Ú>ÃÖ>³ª¸ÓÁö)
		String[] firstKor= {"¸¶", "³ª", "¹æ", "¿À", "Áö", "µÎ", "±è", "ÀÌ", "¹Ú", "ÃÖ", "Á¤", "°­", "Á¶", "À±", "Àå", "ÀÓ", "ÇÑ",
				"¿À", "¼­", "½Å", "±Ç", "È²", "¾È", "¼Û", "Àü", "È«", "À¯", "°í", "¹®", "¾ç", "¼Õ", "¹è", "Á¶", "¹é", "Çã", "³²",
				"½É", "³ë", "Á¤", "ÇÏ", "°û", "¼º", "Â÷", "ÁÖ", "¿ì", "±¸", "½Å", "ÀÓ", "Àü", "¹Î"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è", "±è"
				, "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ"
				, "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ"
				, "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ"
				, "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ"
				, "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ", "ÀÌ"
				, "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú"
				, "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú"
				, "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú"
				, "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú", "¹Ú"
				, "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ"
				, "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ", "ÃÖ"};
		
		String[] middle = { "Ãá", "¸¶", "°­", "´ö", "Çã", "Ãæ", "¿ø", "±¤", "Á¦", "Áö", "¼®", "ÇÊ", "½Å", "¾ï", "¿ë", "¸¸", "°¨",
				"¿ì", "¿í", "¿î", "ÀÏ", "±Ç", "Ç³", "Çù", "½Ä", "Ã¢", "Ãµ", "Ã¶", "±¹", "´ë", "µµ", "¼­", "°ü", "º¹", "°ß", "Æò",
				"µÎ", "¿í", "ÀÎ", "Âù", "Áø", "ÆÈ", "ÅÂ", "Çõ", "Àå", "Àü", "±æ", "ÀÍ", "¹¬", "È«", "¹«", "ÈÄ", "¼º", "¾Ï", "ÁÖ",
				"Çö", "´Ü", "µ¿", "¸í", "¿Â", "Á¶", "¹é", "À¯", "¿µ", "Áß", "ºÎ", "¼±", "ÀÇ", "¿¬", "Àç", "½Ç", "½Ã", "¿Á", "°æ",
				"·¡", "±Õ", "Á¤", "º´", "È£", "È¯", "ÇÑ", "»ó", "¼·", "°Ç", "ºÀ", "¿Ï", "À±", "Çå" ,"Ä¡", "ÁØ", "   "};

		String[] end = { "Ãá", "¸¶", "°­", "´ö", "Çã", "Ãæ", "¿ø", "±¤", "Á¦", "Áö", "¼®", "ÇÊ", "½Å", "¾ï", "¿ë", "¸¸", "°¨",
				"¿ì", "¿í", "¿î", "ÀÏ", "±Ç", "Ç³", "Çù", "½Ä", "Ã¢", "Ãµ", "Ã¶", "±¹", "´ë", "µµ", "¼­", "°ü", "º¹", "°ß", "Æò",
				"µÎ", "¿í", "ÀÎ", "Âù", "Áø", "ÆÈ", "ÅÂ", "Çõ", "Àå", "Àü", "±æ", "ÀÍ", "¹¬", "È«", "¹«", "ÈÄ", "¼º", "¾Ï", "ÁÖ",
				"Çö", "´Ü", "µ¿", "¸í", "¿Â", "Á¶", "¹é", "À¯", "¿µ", "Áß", "ºÎ", "¼±", "ÀÇ", "¿¬", "Àç", "½Ç", "½Ã", "¿Á", "°æ",
				"·¡", "±Õ", "Á¤", "º´", "È£", "È¯", "ÇÑ", "»ó", "¼·", "°Ç", "ºÀ", "¿Ï", "À±", "Çå" ,"Ä¡", "ÁØ"};
		
		System.out.println("- ÃÑ " + (50 * (end.length+1) * end.length) + " Á¾·ùÀÇ ÀÌ¸§À» ¸¸µé¼öÀÖ½À´Ï´Ù.");
		System.out.print("* ¼º¾¾°¡ ±è,ÀÌ,¹Ú,ÃÖ·Î ³ª¿Ã È®·üÀ» ³ôÀÏ±î¿ä? (yes¶ó¸é 1) \t");
		int answer = sc.nextInt();
		System.out.println();
		

			
			if(answer==1) {
				System.out.println("- ±è>ÀÌ>¹Ú>ÃÖ>³ª¸ÓÁö ¼º¾¾ È®·ü·Î ÀÌ¸§ÀÌ ¸¸µé¾îÁý´Ï´Ù.");
			}
			
			System.out.print("* ¸î°³ÀÇ ÀÌ¸§À» »õ·Î ¸¸µé±î¿ä?\t");
			int count = sc.nextInt();
			
			String[] nameArr = new String[count];
			
			if (count == 0) {
				
			} else {
				System.out.println("--------------------------------------");

				
				for (int i = 1; i <= count; i++) {

					String name = "";
					
					
					// (int)(Math.random() * (ÃÖ´ë°ª-ÃÖ¼Ò°ª +1)) + ÃÖ¼Ò°ª

					int randomNum1 = (int) (Math.random() * first.length);
					int randomNum2 = (int) (Math.random() * middle.length);
					int randomNum3 = (int) (Math.random() * end.length);

					if(answer==1) {
						name += firstKor[(int)(Math.random() * firstKor.length)];
					} else{
						name += first[randomNum1];
					}
					

					boolean flag1 = middle[randomNum2].equals(first[randomNum1]);
					while (flag1) {
						randomNum2 = (int) (Math.random() * middle.length);
						flag1 = middle[randomNum2].equals(first[randomNum1]);
					}

					name += middle[randomNum2];

					boolean flag2 = end[randomNum3].equals(middle[randomNum2]);
					while (flag2) {
						randomNum3 = (int) (Math.random() * end.length);
						flag2 = end[randomNum3].equals(middle[randomNum2]);
					}

					name += end[randomNum3];
					nameArr[i-1] = name;

				}
				
				Arrays.sort(nameArr);
				
				// Ãâ·Â¹®
				for(int i = 1 ;i <= nameArr.length;i++) {
					System.out.print(nameArr[i-1] + "\t");
					if(i%col==0||i==nameArr.length) {
						System.out.println();
					}
				}
				
				System.out.println("--------------------------------------");
				System.out.println("ÀúÀåÇÒ±î¿ä?");
				String storeAnswer = sc.next();
				if(storeAnswer.equals("Y")) {
					return nameArr;
							
				}else {
					return null;
				}
				
			
		}
			return null;

	}

}
